books = [
    {
        "title": "Шепот Забытых Звезд",
        "author": "Елена Волгина",
        "year": 2021
    },
    {
        "title": "Машина Времени 2.0",
        "author": "Артур Грейсон",
        "year": 2024
    },
    {
        "title": "Код Авроры",
        "author": "Сергей Ковалев",
        "year": 2018
    },
    {
        "title": "Последний Атлант",
        "author": "Мария Смит",
        "year": 2005
    },
    {
        "title": "Сад Полуночи",
        "author": "Иван Петров",
        "year": 1999
    }
]

# Используем enumerate() для получения индекса (index) и значения (book)
# index будет 0, 1, 2, 3, 4
# book будет словарем из списка (например, {"title": "...", ...})
for index, book in enumerate(books):
    # Номер книги для вывода пользователю, начинающийся с 1
    book_num = index + 1
    
    # Доступ к элементам СЛОВАРЯ по СТРОКОВОМУ ключу:
    title = book['title']
    author = book['author']
    year = book['year']
    
    # Вывод информации в заданном формате
    print(f"---------------------- Книга {book_num} -----------------------")
    print(f" Название: {title}, Автор: {author},")
    print(f" -------------------------{year}-------------------------")
    print() # Пустая строка для разделения записей